cricket2009/SpO2_MSP430/MSP430F5528/AFE44x0_main.c
/*  
 * ======== Init_Clock ========
 */
void Init_Clock (void)
{
    //Initialization of clock module
    P1SEL |= BIT0;  // P1.0 as ACLK, ACLK (8Mhz)for AFE44X0
    P1DIR |= BIT0;  // output
//    P7SEL |= BIT7;  // P7.7 as MCLK, for test
//    P7DIR |= BIT7;  // output
    UCSCTL5 |= DIVPA__4; // ACLK/2 at external pin, (即 16M/2)
    UCSCTL3 = SELREF__REFOCLK;  // use REFO to source the FLL,  FLLREFDIV (n): 000-1分频
    UCSCTL4 = (UCSCTL4 & ~(SELA_7|SELM_7)) | (SELA__DCOCLK) | (SELM__DCOCLK); //DCOCLK for ACLK and MCLK
    
    Init_FLL_Settle(SYS_CLK / 1000, SYS_CLK / 32768);   //Start the FLL,  DCOCLK = 24Mhz
//   Init_FLL_Settle(USB_MCLK_FREQ / 1000, USB_MCLK_FREQ / 32768);   //set FLL (DCOCLK)
}


void Show_Wait_Symbol(const UCHAR *p)
{
    HalOledShowString(SPO2_Symbol_Start_X,0,12,p);
    HalOledShowWaitSymbol(SPO2_Wait_Symbol_Start_X,SPO2_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(SPO2_Wait_Symbol_Start_X+16,SPO2_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(SPO2_Wait_Symbol_Start_X+32,SPO2_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(HR_Wait_Symbol_Start_X,HR_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(HR_Wait_Symbol_Start_X+16,HR_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(HR_Wait_Symbol_Start_X+32,HR_Wait_Symbol_Start_Y,1);
    
    // 显示电量
    HalShowBattVol(BATTERY_MEASURE_SHOW);
}
/*  
 * ======== Init_Ports ========
 */
void Init_Ports (void)
{
    //Initialization of ports (all unused pins as outputs with low-level
    P1OUT = 0xFF;
    P1DIR = 0xFF;
    P2OUT = 0xFF;
    P2DIR = 0xFF;
    P3OUT = 0x00;
    P3DIR = 0xFF;
    P4OUT = 0x00;
    P4DIR = 0xFF;
    P5OUT = 0x00;
    P5DIR = 0xFF;
    P6OUT = 0x00;
    P6DIR = 0xFF;
//    P7OUT = 0x00;
//    P7DIR = 0xFF;
//    P8OUT = 0x00;
//    P8DIR = 0xFF;
    #if defined (__MSP430F563x_F663x)
		P9OUT = 0x00;
		P9DIR = 0xFF;
    #endif
}



/*  
 * ======== Init_TimerA1 ========
 */
void Init_TimerA1 (void)
{
    TA1CCR0 = 50000;
    TA1CTL |= TASSEL_1 + MC_1 + TACLR; //ACLK--16Mhz, clear TAR
}



/*  
 * ======== TIMER1_A0_ISR ========
 */
int xxxx = 0;
#pragma vector=TIMER1_A0_VECTOR
__interrupt void TIMER1_A0_ISR (void)
{
  TA1CCTL0 &= ~CCIE;                  //CCR0 interrupt disable
  if(xxxx < 1)
    xxxx++;
  else
  {
    xxxx = 0;
    if(HR_update == 1)
    {
      //OLEDShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,1); //大心
      //OLEDRefresh_Gram();       
      HR_update = 0;
    }
    else if(!Finger_out)
    {
      //OLEDShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,0); //清空
      //OLEDRefresh_Gram();    
    }
    
  }
  TA1CCTL0 |= CCIE;                 //CCR0 interrupt enable
  
}

// UART1--CC2530 接收中断函数
#pragma vector=USCI_A1_VECTOR
__interrupt void UART1_CC2530RX_ISR(void)
{
  static uint8 receiveFlag = 0;
  static uint8 controlMessage = 0;
  Device_waite_time1 = 0;
  uint8 receiveMessage = UCA1RXBUF;
  switch(receiveFlag)
  {
    case 0:
      if(receiveMessage == DATA_START)
        receiveFlag = 1;
      else
        receiveFlag = 0;
      break;
    case 1:
        controlMessage = receiveMessage;
        receiveFlag = 2;
      break;
    case 2:
      if(receiveMessage == DATA_END)
      {
        Device_waite_time1 = 0;  //等待状态计数值清0
        Finger_out_num = 0;      //计数器状态清0
 
        // 根据controlMessage的值进行不同的处理
        switch(controlMessage)
        {
          case START_MEASURE: //启动测量命令
            if(SpO2SystemStatus == SpO2_ON_SLEEP || SpO2SystemStatus == SpO2_ONLINE_IDLE) // 在线睡眠状态或在线空闲状态
            {
              if(SpO2SystemStatus == SpO2_ON_SLEEP) // 处于睡眠状态先退出低功耗
                LPM3_EXIT; // 退出低功耗
              
              SpO2SystemStatus = SpO2_ONLINE_MEASURE;
              
              HalOledShowString(SPO2_Symbol_Start_X,0,12,"On_Go   ");
              //打开显示器
              HalOledOnOff(HAL_OLED_MODE_ON);
              // 初始化写入次数
              writeNum = 0;
              //打开AFE4400
              AFE44xx_PowerOn();
              //打开AFE4400的中断
              Enable_AFE44xx_DRDY_Interrupt();

            }
            break;
          
          case STOP_MEASURE: // 停止测量命令
            if(SpO2SystemStatus == SpO2_ONLINE_MEASURE)
            {
               SpO2SystemStatus = SpO2_ONLINE_IDLE;
              //关闭AFE4400的中断
              Disable_AFE44xx_DRDY_Interrupt();          
              //关闭AFE4400
              AFE44xx_PowerOff();
              HalOledShowString(0,30,32,"        ");  //8个空格，完全清空
              Show_Wait_Symbol("On_IDLE ");
              //OLEDShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,0); //清空心型图标       
            }
            break;
            
          case SYNC_MEASURE: // 同步消息，暂不处理
            break;
            
          case FIND_NWK:  // 正在找网消息
            if(SpO2SystemStatus == SpO2_ONLINE_MEASURE || SpO2SystemStatus == SpO2_OFFLINE_MEASURE) // 如果是正在在线或离线测量
            {
              // 停止测量
              Disable_AFE44xx_DRDY_Interrupt();          
              //关闭AFE4400
              AFE44xx_PowerOff();
           
            }
            if(SpO2SystemStatus == SpO2_OFF_SLEEP || SpO2SystemStatus == SpO2_ON_SLEEP) // 如果是睡眠
            {
               LPM3_EXIT;
               //打开显示器
               HalOledOnOff(HAL_OLED_MODE_ON);
            }
            SpO2SystemStatus = SpO2_FIND_NETWORK;
            HalOledShowString(0,30,32,"        ");  //8个空格，完全清空
            //OLEDShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,0); //清空心型图标   
            Show_Wait_Symbol("FIND_NWK");
            break;
            
          case END_DEVICE:  // 找到网络消息 只可能从FIND_NWK到这个状态
            SpO2SystemStatus = SpO2_ONLINE_IDLE;
            Show_Wait_Symbol("On_IDLE ");
            break;
             
          case CLOSEING:   // 正在关闭网络消息
            if(SpO2SystemStatus == SpO2_ONLINE_MEASURE) // 在线测量状态关闭网络
            {
              // 关闭测量
              Disable_AFE44xx_DRDY_Interrupt();          
              //关闭AFE4400
              AFE44xx_PowerOff();
              //OLEDShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,0); //清空心型图标             
            }
            // 在线空闲状态或寻找网络状态下下关闭网络
            if(SpO2SystemStatus == SpO2_ON_SLEEP) // 睡眠状态下关闭网络
            {
              HalOledOnOff(HAL_OLED_MODE_ON);
              LPM3_EXIT;    
            }
            SpO2SystemStatus = SpO2_CLOSING;
            HalOledShowString(0,30,32,"        ");  //8个空格，完全清空
            Show_Wait_Symbol("CLOSING ");
            break;
            
          case CLOSE_NWK:
              SpO2SystemStatus = SpO2_OFFLINE_IDLE;
              Show_Wait_Symbol("Off_IDLE");
            break;
          default:break;

